# Parameter Type Id Rebar Elem Termination Start Orient Property

Source: https://www.revitapidocs.com/2026/a8e7c72a-5fa6-1e2f-174e-9a044109b912.htm

---

| Parameter Type Id Rebar Elem Termination Start Orient Property |
| --- |

"Orientation At Start"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarElemTerminationStartOrient { get; }
```

```
Public Shared ReadOnly Property RebarElemTerminationStartOrient As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarElemTerminationStartOrient {
	ForgeTypeId^ get ();
}
```

```
static member RebarElemTerminationStartOrient : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace